{
  "slug": "estimation-checklist",
  "title": "Estimation Checklist",
  "description": "This is not an estimation methedology or a replacement for good practices. it is a simple collaborative checklist of questions that one should remember to ask when preforming such an estimation of a project or large-grained features. Some of these might not apply to you or have no answers, most should probably at least be discussed with the client.",
  "tags": ["estimation", "checklist"],
  "content": "# Estimation Checklist\n\nThis is not an estimation methedology or a replacement for good practices. it is a simple collaborative checklist of questions that one should remember to ask when preforming such an estimation of a project or large-grained features. Some of these might not apply to you or have no answers, most should probably at least be discussed with the client.\n\n- [ ] Is there an area for administrators? What goes in there?\n  - [ ] Is there an area for super-users?\n- [ ] What happens when entity X is deleted?\n  - [ ] Can X even be deleted or just disabled? Is there a difference?\n  - [ ] What happens to entities that reference X?\n  - [ ] What happens to entities that X referenes?\n- [ ] What is the CRUD workflow for each entity?\n  - [ ] Which actions need approvals? How should approvals work?\n  - [ ] Can any actions be un-done by the user?\n  - [ ] Can users save drafts of updates? How does this interact with approvals, deletions & access?\n- [ ] What are system/browser requirements? \n  - [ ] Can there be different ones for users in different roles? (eg admins will always use chrome latest)\n  - [ ] What are the expectations for offline functionality?\n- [ ] How will authentication work?\n  - [ ] Will users register themselves for the system?\n    - [ ] Can anyone register or do you need an invite?\n    - [ ] Will this change over time? (eg beta invites)\n    - [ ] Who sends invites? Where is the UI for this?\n  - [ ] Is Oauth integration necessary? (eg Facebook or Google) Mandatory? (This can be great as then you don't have to store account info at all)\n  - [ ] How will [forgotten usernames/passwords be handled?](http://www.troyhunt.com/2012/05/everything-you-ever-wanted-to-know.html)?\n- [ ] What are the different usage roles within the system? (eg super-admin, manager, registered user, guest) \n  - [ ] How are authorization permissions assigned and managed? \n    - Which users should have access to which functionality?\n    - Which users should have access to which data? (eg. a sales rep can't access notes on leads of other sales reps)\n  - [ ] Which portions of the application are publically accessible?\n- [ ] How often will a given page realistically be accessed? (especially important for pages containing lots of dynamic data)\n- [ ] What is the infrastructure for deploying the application?\n  - [ ] Who will support the deployment? What is their skillset?\n  - [ ] Are there limitions on technology imposed by the client's infrastructure/team?\n  - [ ] How will the application be deployed initially?\n  - [ ] How will updates to the application be delivered? By whom?\n  - [ ] Who will handle setting up an SSL certificate?\n  - [ ] How should application health be monitored?\n- [ ] What are any integration points?\n  - [ ] What external systems must this application recieve messages from?\n  - [ ] What external systems must this application send messages to?\n    - [ ] Are there downloads that must be in any particular format?\n- [ ] How will migration from existing systems work?\n  - [ ] How will data be imported into the system upon launch?\n  - [ ] What is the strategy if we have to roll back to the old system after launch? (eg due to bugs)\n  - [ ] If we roll back, how will any data entered into the new system be pushed back into the old system?\n- [ ] What sorts of reports should be available?\n  - [ ] Which reports are available to each role?\n  - [ ] How often will each report be run?\n  - [ ] How up-to-date must each report be? (eg is containing day-old stale data ok?)\n  - [ ] What format must each report be available in? (eg html, csv, xls, pdf)\n  - [ ] Will these reports be imported into another system?\n  - [ ] What sort of analytics and user-tracking information is required?\n    - [ ] How should this information be accessible?\n- [ ] For screens showing large amounts of data, must it be possible to display details of old data or is reporting sufficient for this?\n- [ ] What personal information will be stored?\n  - [ ] Is some data protected by PCI or HIPAA?\n  - [ ] What information must be taken extra care with? (eg a system which stores names and addresses especially of minors)\n- [ ] How long are you expected to support bugs?\n- [ ] Who will handle user support and questions?\n  - [ ] How exactly will users get in touch with support?\n- [ ] Which features exactly are necessary for MVP?\n  - [ ] Is it possible to get the core functionality prototyped in a few weeks with some scripts/Excel macros/etc?\n  - [ ] How fancy do UI controls need to be? (eg can you just use built-in HTML5 browser validation)\n- [ ] What are expectations for timelines?\n  - [ ] When would you like MVP to launch?\n  - [ ] Are there constraints by which MVP *must* launch? (eg the old system becomes deprecated in August)\n  - [ ] When would you like there to be be a Beta launch? What should go into it over MVP?\n  - [ ] When would you like the application to go public?\n- [ ] Are users uploading files?\n  - [ ] What are expectations for typical and maximum file size? How much storage must be available in the foreseeable future?\n  - [ ] What is the expected frequency of downloads?\n  - [ ] How fancy does the upload and download functionality have to be?\n- [ ] If entity X has an optional reference to entity Y (it might refer to one or zero instances), would the model be better served by structuring it as a one-to-many up front?\n- [ ] If the application shows user input, how will moderation of abusive comments be handled?\n  - [ ] How will something be flagged for moderation?\n  - [ ] Who will do the moderation? What sort of UI will they have?\n  - [ ] What happens if a moderator is abusive?\n\n### Resources\n- [estimation-checklist](https://github.com/togakangaroo/estimation-checklist)\n\n"
}
